[
  {
    "id": "af8778fa-0dfe-4f49-b75b-6f80af7d0485",
    "name": "casper",
    "year": "1995",
    "sourceData": [
      {
        "provider": "imdb",
        "name": "IMDB",
        "data": {
          "rating": 62,
          "plot": "An afterlife therapist and his daughter meet a friendly young ghost when they move into a crumbling mansion in order to rid the premises of wicked spirits.",
          "url": "https://m.media-amazon.com/images/M/MV5BZmQzZThjNDQtMjAxNC00YzhjLWFkNmItZDg4NjkxNjZkMjMxXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_QL75_UX190_CR0,1,190,281_.jpg"
        }
      },
      {
        "provider": "rottenTomatoes",
        "name": "Rotten Tomatoes",
        "data": {
          "rating": 52,
          "plot": "Casper (voiced by Malachi Pearson) is a kind young ghost who peacefully haunts a mansion in Maine. When specialist James Harvey (Bill Pullman) arrives to communicate with Casper and his fellow spirits, he brings along his teenage daughter, Kat (Christina Ricci). Casper quickly falls in love with Kat, but their budding relationship is complicated not only by his transparent state, but also by his troublemaking apparition uncles and their mischievous antics.",
          "url": "https://resizing.flixster.com/dd2eGpATStA-X37got-kDVmIO6Q=/206x305/v2/https://resizing.flixster.com/-XZAfHZM39UwaGJIFWKAE8fS0ak=/v3/t/assets/p16786_p_v13_bc.jpg"
        }
      },
      {
        "provider": "metacritic",
        "name": "Metacritic",
        "data": {
          "rating": 49,
          "plot": "\"Ghost therapist\" Dr. James Harvey (Bill Pullman) and his daughter Kat (Christina Ricci) arrive at drafty, old Whipstaff Manner. Its greedy owner, Carrigan Crittendon (Cathy Moriarty), has hired Dr. Harvey to exorcise the house's apparitions: a friendly but lonely young ghost named Casper, who's just looking for a friend, and his outrage... ",
          "url": ""
        }
      }
    ]
  },
  {
    "id": "71c1fd3d-3192-46fc-a50f-111a2e86add8",
    "name": "drop dead fred",
    "year": "1991",
    "sourceData": [
      {
        "provider": "imdb",
        "name": "IMDB",
        "data": {
          "rating": 59.00000000000001,
          "plot": "A young woman finds her already unstable life rocked by the presence of a rambunctious imaginary friend from childhood.",
          "url": "https://m.media-amazon.com/images/M/MV5BOGZmZGE5YzQtOTFlOS00NmZiLWI3YTYtMjNiZmU4ZTM5MDY5XkEyXkFqcGc@._V1_QL75_UX190_CR0,2,190,281_.jpg"
        }
      },
      {
        "provider": "rottenTomatoes",
        "name": "Rotten Tomatoes",
        "data": {
          "rating": 11,
          "plot": "An unhappy housewife (Phoebe Cates) gets a lift from the return of her imaginary childhood friend, Drop Dead Fred (Rik Mayall).",
          "url": "https://resizing.flixster.com/E18o4e8v27InTQQ_mHE4HxQ5wxI=/206x305/v2/https://resizing.flixster.com/cJoLYAMHYC0h9lVDfDi_Iarc4Kc=/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzLzNjNTQ3MzBlLTI3Y2UtNDA0ZS04MDBiLWEzM2JiZWExYjkzMy53ZWJw"
        }
      },
      {
        "provider": "metacritic",
        "name": "Metacritic",
        "data": {
          "rating": 39,
          "plot": "Dream-haunting Freddy Krueger returns yet again to troll the nightmares of Springwood's last surviving teenager, and of a woman whose personal connection to Krueger may mean his doom.",
          "url": ""
        }
      }
    ]
  },
  {
    "id": "9ef080ec-8bc8-4d4d-b324-a0486c30b0e6",
    "name": "dumb and dumber",
    "year": "1994",
    "sourceData": [
      {
        "provider": "imdb",
        "name": "IMDB",
        "data": {
          "rating": 73,
          "plot": "After a woman leaves a briefcase at the airport terminal, a dumb limo driver and his dumber friend set out on a hilarious cross-country road trip to Aspen to return it.",
          "url": "https://m.media-amazon.com/images/M/MV5BZDQwMjNiMTQtY2UwYy00NjhiLTk0ZWEtZWM5ZWMzNGFjNTVkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UY281_CR1,0,190,281_.jpg"
        }
      },
      {
        "provider": "rottenTomatoes",
        "name": "Rotten Tomatoes",
        "data": {
          "rating": 68,
          "plot": "Imbecilic best friends Lloyd Christmas (Jim Carrey) and Harry Dunne (Jeff Daniels) stumble across a suitcase full of money left behind in Harry's car by Mary Swanson (Lauren Holly), who was on her way to the airport. The pair decide to go to Aspen, Colo., to return the money, unaware that it is connected to a kidnapping. As Harry and Lloyd -- who has fallen in love with Mary -- are pursued across the country by hired killers and police, they find both their friendship and their brains tested.",
          "url": "https://resizing.flixster.com/YayjdjnSwEW3ApleKwYsbccpIW4=/206x305/v2/https://resizing.flixster.com/-XZAfHZM39UwaGJIFWKAE8fS0ak=/v3/t/assets/p16298_p_v8_ae.jpg"
        }
      },
      {
        "provider": "metacritic",
        "name": "Metacritic",
        "data": {
          "rating": 41,
          "plot": "Two stupid guys, Lloyd (Carrey) and Harry (Daniels) decide to drive across country from Providence, Rhode Island to Aspen, Colorado to return a briefcase left in the airport by Mary Swanson (Holly), the object of Lloyd's affection.",
          "url": ""
        }
      }
    ]
  },
  {
    "id": "cbbadffc-5d9e-481f-98e9-8b763ac9d633",
    "name": "stand by me",
    "year": "1986",
    "sourceData": [
      {
        "provider": "imdb",
        "name": "IMDB",
        "data": {
          "rating": 81,
          "plot": "A writer recounts a childhood journey with his friends to find the body of a missing boy.",
          "url": "https://m.media-amazon.com/images/M/MV5BODJmY2Y2OGQtMDg2My00N2Q3LWJmZTUtYTc2ODBjZDVlNDlhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX190_CR0,9,190,281_.jpg"
        }
      },
      {
        "provider": "rottenTomatoes",
        "name": "Rotten Tomatoes",
        "data": {
          "rating": 92,
          "plot": "After learning that a stranger has been accidentally killed near their rural homes, four Oregon boys decide to go see the body. On the way, Gordie Lachance (Wil Wheaton), Vern Tessio (Jerry O'Connell), Chris Chambers (River Phoenix) and Teddy Duchamp (Corey Feldman) encounter a mean junk man and a marsh full of leeches, as they also learn more about one another and their very different home lives. Just a lark at first, the boys' adventure evolves into a defining event in their lives.",
          "url": "https://resizing.flixster.com/rPl5Jenn68NFcSNq8kklgXmbdkA=/206x305/v2/https://resizing.flixster.com/-XZAfHZM39UwaGJIFWKAE8fS0ak=/v3/t/assets/p9417_p_v10_ay.jpg"
        }
      },
      {
        "provider": "metacritic",
        "name": "Metacritic",
        "data": {
          "rating": 75,
          "plot": "Stand by Me's screenplay by Raynold Gideon and Bruce A. Evans is based on Stephen King's novella \"The Body,\" a somewhat autobiographical account of an overnight hike by four Oregon youngsters to seek the body of a boy who had been struck by a train. [New York Times]",
          "url": ""
        }
      }
    ]
  },
  {
    "id": "2506ddc7-fc62-419d-9194-21a174e038a4",
    "name": "toy story",
    "year": "1995",
    "sourceData": [
      {
        "provider": "imdb",
        "name": "IMDB",
        "data": {
          "rating": 83,
          "plot": "A cowboy doll is profoundly threatened and jealous when a new spaceman action figure supplants him as top toy in a boy's bedroom.",
          "url": "https://m.media-amazon.com/images/M/MV5BMDU2ZWJlMjktMTRhMy00ZTA5LWEzNDgtYmNmZTEwZTViZWJkXkEyXkFqcGdeQXVyNDQ2OTk4MzI@._V1_QL75_UX190_CR0,1,190,281_.jpg"
        }
      },
      {
        "provider": "rottenTomatoes",
        "name": "Rotten Tomatoes",
        "data": {
          "rating": 100,
          "plot": "Woody (Tom Hanks), a good-hearted cowboy doll who belongs to a young boy named Andy (John Morris), sees his position as Andy's favorite toy jeopardized when his parents buy him a Buzz Lightyear (Tim Allen) action figure. Even worse, the arrogant Buzz thinks he's a real spaceman on a mission to return to his home planet. When Andy's family moves to a new house, Woody and Buzz must escape the clutches of maladjusted neighbor Sid Phillips (Erik von Detten) and reunite with their boy.",
          "url": "https://resizing.flixster.com/Q_eOheUnRt1L271Ow8RG-jNDqOk=/206x305/v2/https://resizing.flixster.com/-XZAfHZM39UwaGJIFWKAE8fS0ak=/v3/t/assets/p17420_p_v12_bc.jpg"
        }
      },
      {
        "provider": "metacritic",
        "name": "Metacritic",
        "data": {
          "rating": 96,
          "plot": "Led by Woody, Andy's toys live happily in his room until Andy's birthday brings Buzz Lightyear onto the scene. Afraid of losing his place in Andy's heart, Woody plots against Buzz. But when circumstances separate Buzz and Woody from their owner, the duo eventually learns to put aside their differences. [Pixar]",
          "url": ""
        }
      }
    ]
  }
]